Documents/Renault_CRM_ОбращениеВАвтоСервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_CRM_ОбращениеВАвтоСервис</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидыОбращенийВАвтосервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упущено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЧерновикиАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жалоба</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбращениеОбработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверенВICM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменилЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаУпущения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПричиныУпущенияОбращенийАвтосервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внутренний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ИсточникиОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПримечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖалобаКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОбращениеКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailОтправлен</Name>
					<Comment>Означает то, что по данному обращению было отправлено письмо по Email клиенту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОнлайнЗаписи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОнлайнЗаписьВАвтосервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерКупонов_Промокод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерКупонов_Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МенеджерКупоновАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерКупонов_Подакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МенеджерКупоновАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерКупонов_ПримененПромокод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерКупонов_Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыбранныеАкции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ЦентрализованныеАкции</v8:Type>
								<v8:Type>cfg:CatalogRef.Renault_АкцииИСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыбранныеПрограммыЛояльности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрограммыЛояльности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПрограммыЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыОщущенийКлиента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОщущения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDR_КодыОщущенийКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МенеджерКупонов_Реферансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Референс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_МенеджерКупоновРеференс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_АвтомобилиДопРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтомобилиДопРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СемействоАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СемействаАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СалонныйФильтр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГУР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AC</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоПринятоНаСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамечаниеПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриемкиНаСклад</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМоделиДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексМоделиДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМоделиКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексМоделиКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодТипаКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ФазыМоделей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продавец</Name>
					<Comment>Дилерский центр, который продал авто</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТоплива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ABS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПривода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПриводАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегионЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Регионы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОСАГО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияОСАГО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаКАСКО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияКАСКО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКлиматическойУстановки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтоработыЦеныЗапчастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтоработыЦеныЗапчастей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PNC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PCL</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Запчасть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Renault_CRM_ОбращениеВАвтоСервис/Forms/ФормаКомплексовАвторабот/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()

	Автомобиль = Параметры.Автомобиль;
	ГУР = Параметры.ГУР;
	Кондиционер = Параметры.Кондиционер;
	СалонныйФильтр = Параметры.СалонныйФильтр;
	ТарифнаяЗона = Параметры.ТарифнаяЗона;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Renault_АвтомобилиДопРеквизиты.Автомобиль,
		|	Renault_АвтомобилиДопРеквизиты.СалонныйФильтр,
		|	Renault_АвтомобилиДопРеквизиты.ГУР,
		|	Renault_АвтомобилиДопРеквизиты.AC,
		|	Renault_АвтомобилиДопРеквизиты.КодМоделиДвигателя,
		|	Renault_АвтомобилиДопРеквизиты.ИндексМоделиДвигателя,
		|	ПОДСТРОКА(Renault_АвтомобилиДопРеквизиты.Автомобиль.Модель.Артикул, 0, 3) КАК КодТипаКузова,
		|	Renault_АвтомобилиДопРеквизиты.Фаза,
		|	Renault_АвтомобилиДопРеквизиты.ТипДвигателя,
		|	Renault_АвтомобилиДопРеквизиты.ТипТоплива,
		|	Renault_АвтомобилиДопРеквизиты.ABS,
		|	Renault_АвтомобилиДопРеквизиты.КодМоделиКПП,
		|	Renault_АвтомобилиДопРеквизиты.ИндексМоделиКПП
		|ИЗ
		|	РегистрСведений.Renault_АвтомобилиДопРеквизиты КАК Renault_АвтомобилиДопРеквизиты
		|ГДЕ
		|	Renault_АвтомобилиДопРеквизиты.Автомобиль = &Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Renault_АвтомобилиДопРеквизиты.КодМоделиДвигателя + ВЫБОР
		|		КОГДА Renault_АвтомобилиДопРеквизиты.ИндексМоделиДвигателя = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" "" + Renault_АвтомобилиДопРеквизиты.ИндексМоделиДвигателя
		|	КОНЕЦ КАК КодДвигателя
		|ПОМЕСТИТЬ КодДвигателяАвтомобиля
		|ИЗ
		|	РегистрСведений.Renault_АвтомобилиДопРеквизиты КАК Renault_АвтомобилиДопРеквизиты
		|ГДЕ
		|	Renault_АвтомобилиДопРеквизиты.Автомобиль = &Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Renault_АвтоработыДопРеквизиты.ТипДвигателя,
		|	Renault_АвтоработыДопРеквизиты.Привод
		|ИЗ
		|	РегистрСведений.Renault_АвтоработыДопРеквизиты КАК Renault_АвтоработыДопРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодДвигателяАвтомобиля КАК КодДвигателяАвтомобиля
		|		ПО Renault_АвтоработыДопРеквизиты.КодДвигателя = КодДвигателяАвтомобиля.КодДвигателя";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		КодМоделиКузова = Выборка.КодТипаКузова;
	    СалонныйФильтр = Выборка.СалонныйФильтр;
		ГУР = Выборка.ГУР;
	    Кондиционер = Выборка.AC;
		Фаза = ?(Не ЗначениеЗаполнено(Выборка.Фаза), "Фаза 1", Выборка.Фаза);
		ABS = Выборка.ABS;
		ТипТоплива = Выборка.ТипТоплива;
		ТипДвигателя = Выборка.ТипДвигателя;
		ABS = Выборка.ABS;
		КодТипаДвигателя = Выборка.КодМоделиДвигателя;
		КодКПП = Выборка.КодМоделиКПП; 
		ИндексДвигателя = Выборка.ИндексМоделиДвигателя;
		ИндексКПП = Выборка.ИндексМоделиКПП;
	КонецЕсли; 
	
	Привод = "4x2";
	
	Если Не РезультатЗапроса[2].пустой() Тогда
		Таб = РезультатЗапроса[2].Выгрузить();
	    Элементы.ТипДвигателя.СписокВыбора.ЗагрузитьЗначения(Таб.ВыгрузитьКолонку("ТипДвигателя"));
		Элементы.ТипДвигателя.РежимВыбораИзСписка = Истина;
		Привод = ?(Таб[0].Привод = "", Привод, Таб[0].Привод);
	КонецЕсли; 
	
	ЗаполнитьДеревоАвтоработНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоАвтоработНаСервере()
	
	Отборы = Новый Структура;
	Если НЕ Фаза.Пустая() Тогда Отборы.Вставить("Фаза", Фаза) КонецЕсли;
	Если ТипДвигателя <> "" Тогда Отборы.Вставить("ТипДвигателя", ТипДвигателя) КонецЕсли;
	Если ТипТоплива <> "" Тогда Отборы.Вставить("ТипТоплива", ТипТоплива) КонецЕсли;
	Если СалонныйФильтр Тогда Отборы.Вставить("СалонныйФильтр", СалонныйФильтр) КонецЕсли;
	Если ГУР Тогда Отборы.Вставить("ГУР", ГУР) КонецЕсли;
	Если Кондиционер Тогда Отборы.Вставить("Кондиционер", Кондиционер) КонецЕсли;
	Если Привод <> "" Тогда Отборы.Вставить("Привод", Привод) КонецЕсли;
	Если КодТипаДвигателя <> "" Тогда Отборы.Вставить("КодДвигателя", КодТипаДвигателя) КонецЕсли;
	Если ABS Тогда Отборы.Вставить("ABS", ABS) КонецЕсли;
	Если ИндексДвигателя <> "" Тогда Отборы.Вставить("ИндексДвигателя", ИндексДвигателя) КонецЕсли;
	Если КодКПП <> "" Тогда Отборы.Вставить("КодКПП", КодКПП) КонецЕсли;
	Если ИндексКПП <> "" Тогда Отборы.Вставить("ИндексКПП", ИндексКПП) КонецЕсли;
	
	//количество модификаций по регистру
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодМодели", КодМоделиКузова);
	Запрос.Текст = "
	//общее кол-во различных кроме пустых
	|Выбрать
	|	КолВоРазличных.ТипРаботы,
	|	Фаза_К-ЕстьNULL(Фаза_ПЗ,0) Фаза,
	|	ТипДвигателя_К-ЕстьNULL(ТипДвигателя_ПЗ,0) ТипДвигателя,
	|	ТипТоплива_К-ЕстьNULL(ТипТоплива_ПЗ,0) ТипТоплива,
	|	СалонныйФильтр_К-ЕстьNULL(СалонныйФильтр_ПЗ,0) СалонныйФильтр,
	|	ГУР_К-ЕстьNULL(ГУР_ПЗ,0) ГУР,	
	|	Кондиционер_К-ЕстьNULL(Кондиционер_ПЗ,0) Кондиционер,
	|	Привод_К-ЕстьNULL(Привод_ПЗ,0) Привод,
	|	КодДвигателя_К-ЕстьNULL(КодДвигателя_ПЗ,0) КодДвигателя,
	|	ABS_К-ЕстьNULL(ABS_ПЗ,0) ABS,
	|	ИндексДвигателя_К-ЕстьNULL(ИндексДвигателя_ПЗ,0) ИндексДвигателя,
	|	КодКПП_К-ЕстьNULL(КодКПП_ПЗ,0) КодКПП,
	|	ИндексКПП_К-ЕстьNULL(ИндексКПП_ПЗ,0) ИндексКПП
	|ИЗ(
	//количество различных
	|	Выбрать
	|		Авторабота.Наименование ТипРаботы,
	|		Количество(Различные Фаза) Фаза_К,
	|		Количество(Различные ТипДвигателя) ТипДвигателя_К,
	|		Количество(Различные ТипТоплива) ТипТоплива_К,
	|		Количество(Различные СалонныйФильтр) СалонныйФильтр_К,
	|		Количество(Различные ГУР) ГУР_К,
	|		Количество(Различные Кондиционер) Кондиционер_К,
	|		Количество(Различные Привод) Привод_К,
	|		Количество(Различные КодДвигателя) КодДвигателя_К,
	|		Количество(Различные ABS) ABS_К,
	|		Количество(Различные ИндексДвигателя) ИндексДвигателя_К,
	|		Количество(Различные КодКПП) КодКПП_К,
	|		Количество(Различные ИндексКПП) ИндексКПП_К
	|	Из РегистрСведений.Renault_АвтоработыДопРеквизиты ГДЕ КодМодели=&КодМодели 
	|	Сгруппировать По Авторабота.Наименование
	|)КолВоРазличных
	//наличие пустых значений
	|Левое Соединение(
	|	Выбрать
	|		ТипРаботы,
	|		Максимум(Фаза) Фаза_ПЗ,
	|		Максимум(ТипДвигателя) ТипДвигателя_ПЗ,
	|		Максимум(ТипТоплива) ТипТоплива_ПЗ,
	|		Максимум(СалонныйФильтр) СалонныйФильтр_ПЗ,
	|		Максимум(ГУР) ГУР_ПЗ,
	|		Максимум(Кондиционер) Кондиционер_ПЗ,
	|		Максимум(Привод) Привод_ПЗ,
	|		Максимум(КодДвигателя) КодДвигателя_ПЗ,
	|		Максимум(ABS) ABS_ПЗ,
	|		Максимум(ИндексДвигателя) ИндексДвигателя_ПЗ,
	|		Максимум(КодКПП) КодКПП_ПЗ,
	|		Максимум(ИндексКПП) ИндексКПП_ПЗ
	|	ИЗ(		
	|		Выбрать
	|			Авторабота.Наименование ТипРаботы,
	|			Выбор Когда Фаза=Значение(Справочник.Renault_ФазыМоделей.ПустаяСсылка) Тогда 1 Иначе 0 Конец Фаза,
	|			Выбор Когда ТипДвигателя="""" Тогда 1 Иначе 0 Конец ТипДвигателя,
	|			Выбор Когда ТипТоплива="""" Тогда 1 Иначе 0 Конец ТипТоплива,
	|			Выбор Когда Не СалонныйФильтр Тогда 1 Иначе 0 Конец СалонныйФильтр,
	|			Выбор Когда Не ГУР Тогда 1 Иначе 0 Конец ГУР,
	|			Выбор Когда Не Кондиционер Тогда 1 Иначе 0 Конец Кондиционер,
	|			Выбор Когда Привод="""" Тогда 1 Иначе 0 Конец Привод,
	|			Выбор Когда КодДвигателя="""" Тогда 1 Иначе 0 Конец КодДвигателя,
	|			Выбор Когда Не ABS Тогда 1 Иначе 0 Конец ABS,
	|			Выбор Когда ИндексДвигателя="""" Тогда 1 Иначе 0 Конец ИндексДвигателя,
	|			Выбор Когда КодКПП="""" Тогда 1 Иначе 0 Конец КодКПП,
	|			Выбор Когда ИндексКПП="""" Тогда 1 Иначе 0 Конец ИндексКПП
	|		Из РегистрСведений.Renault_АвтоработыДопРеквизиты
	|		ГДЕ КодМодели=&КодМодели 
	|	)ЗП
	|	Сгруппировать По ТипРаботы 
	|)ПустыеЗначения
	|По КолВоРазличных.ТипРаботы=ПустыеЗначения.ТипРаботы
	|";
	ТабМодификацийРесурсов = Запрос.Выполнить().Выгрузить();
	
	МассивАвторабот = Новый Массив;
	Для Каждого СтрРабот Из ТабМодификацийРесурсов Цикл
		ЗП = Новый Запрос("Выбрать Авторабота Из РегистрСведений.Renault_АвтоработыДопРеквизиты ГДЕ КодМодели=&КодМодели И Авторабота.Наименование=&ТипРаботы");
		ЗП.УстановитьПараметр("КодМодели", КодМоделиКузова);
		ЗП.УстановитьПараметр("ТипРаботы", СтрРабот.ТипРаботы);
		СтрокаОтбора = "";
		Для Каждого Эл Из Отборы Цикл
			Если СтрРабот[Эл.Ключ] > 0 Тогда
				СтрокаОтбора = СтрокаОтбора + ?(СтрокаОтбора = "", "", " И ") + Эл.Ключ + "=&" + Эл.Ключ;
				ЗП.УстановитьПараметр(Эл.Ключ, Эл.Значение);
			КонецЕсли;
		КонецЦикла;
		ЗП.Текст = ЗП.Текст + ?(СтрокаОтбора = "", "", " И ") + СтрокаОтбора;
		Для Каждого Работа Из ЗП.Выполнить().Выгрузить().ВыгрузитьКолонку("Авторабота") Цикл
			МассивАвторабот.Добавить(Работа);
		КонецЦикла;
	КонецЦикла;
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.Текст = "
	|ВЫБРАТЬ
	|	АвтоработыЦены.ИтогоНЧ ИтогоНЧ,
	|	ВЫБОР
	|		КОГДА &ТарифнаяЗона=ЗНАЧЕНИЕ(Справочник.Renault_ТарифныеЗоны.ТЗ1) 
	|		ТОГДА АвтоработыЦены.СтоимостьНормоЧасаСНДС1 ИНАЧЕ АвтоработыЦены.СтоимостьНормоЧасаСНДС2
	|	КОНЕЦ СтоимостьНормоЧасаСНДС,
	|	ВЫБОР
	|		КОГДА &ТарифнаяЗона=ЗНАЧЕНИЕ(Справочник.Renault_ТарифныеЗоны.ТЗ1) 
	|		ТОГДА АвтоработыЦены.Цена1ТЗ ИНАЧЕ АвтоработыЦены.Цена2ТЗ
	|	КОНЕЦ ЦенаТЗ,
	|	ЦеныЗапчастей.Запчасть СвязанныеАвтоработы,
	|	ЦеныЗапчастей.Количество,
	|	ЦеныЗапчастей.PNC,
	|	ЦеныЗапчастей.PCL,
	|	Автоработы.Авторабота,
	|	Ложь Выбрать
	|ИЗ РегистрСведений.Renault_АвтоработыДопРеквизиты Автоработы
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтоработыЦены.СрезПоследних АвтоработыЦены ПО Автоработы.Авторабота=АвтоработыЦены.Авторабота
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтоработыЦеныЗапчастей.СрезПоследних ЦеныЗапчастей По Автоработы.Авторабота=ЦеныЗапчастей.Авторабота
	|ГДЕ Автоработы.Авторабота В(&Автоработы)
	
	|УПОРЯДОЧИТЬ ПО Автоработы.Авторабота.Наименование
	|ИТОГИ
	|	МАКСИМУМ(ИтогоНЧ),
	|	МАКСИМУМ(СтоимостьНормоЧасаСНДС),
	|	МАКСИМУМ(ЦенаТЗ)
	|ПО Автоработы.Авторабота
	
	|{ГДЕ 
	|	Автоработы.КодМодели,
	|	Автоработы.Фаза,
	|	Автоработы.ТипДвигателя,
	|	Автоработы.ТипТоплива,
	|	Автоработы.СалонныйФильтр,
	|	Автоработы.ГУР,
	|	Автоработы.Кондиционер,
	|	Автоработы.Привод,
	|	Автоработы.КодДвигателя,
	|	Автоработы.ABS,
	|	Автоработы.ИндексДвигателя,
	|	Автоработы.КодКПП,
	|	Автоработы.ИндексКПП
	|}
	|";
	Построитель.ЗаполнитьНастройки();
	Построитель.Параметры.Вставить("ТарифнаяЗона",ТарифнаяЗона);
	Построитель.Параметры.Вставить("Автоработы",МассивАвторабот);
	//Для Каждого Эл Из МассивОтбора Цикл
	//	Если Не ЗначениеЗаполнено(Эл.Значение) Тогда Продолжить КонецЕсли;
	//	
	//	Запрос=Новый Запрос("Выбрать Количество(Различные "+Эл.Ключ+") КолВо Из РегистрСведений.Renault_АвтоработыДопРеквизиты ГДЕ "+Эл.Ключ+"<>&ПустоеЗначение");
	//	Если Запрос.Выполнить().Выгрузить()[0].КолВо=0 Тогда Продолжить КонецЕсли;
	//	
	//	Отбор=Построитель.Отбор.Добавить(Эл.Ключ);
	//	Отбор.ВидСравнения=ВидСравнения.Равно;
	//	Отбор.Значение=Эл.Значение;
	//	Отбор.Использование=Истина;
	//КонецЦикла;	
	Построитель.Выполнить();
	ЗначениеВРеквизитФормы(Построитель.Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам),"ДеревоКомплексовАвторабот");
	Возврат;
	
	//Если ТипДвигателя = "" или ТипТоплива = "" Тогда
	//    Возврат;	
	//КонецЕсли; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_АвтоработыДопРеквизиты.Авторабота,
		|	ЛОЖЬ КАК Выбрать
		|ПОМЕСТИТЬ ВсеАвтоработы
		|ИЗ
		|	РегистрСведений.Renault_АвтоработыДопРеквизиты КАК Renault_АвтоработыДопРеквизиты
		|ГДЕ
		|	(Renault_АвтоработыДопРеквизиты.КодМодели = &КодМодели
		|			ИЛИ &КодМодели = """")
		|	И (Renault_АвтоработыДопРеквизиты.Фаза = &Фаза
		|			ИЛИ Renault_АвтоработыДопРеквизиты.Фаза = ЗНАЧЕНИЕ(Справочник.Renault_ФазыМоделей.ПустаяСсылка))
		|	И (Renault_АвтоработыДопРеквизиты.КодДвигателя = &КодДвигателя
		|			ИЛИ &КодДвигателя = """")
		|	И Renault_АвтоработыДопРеквизиты.ГУР = &ГУР
		|	И Renault_АвтоработыДопРеквизиты.Кондиционер = &Кондиционер
		|	И (Renault_АвтоработыДопРеквизиты.Привод = &Привод
		|			ИЛИ &Привод = ""4x2"")
		|	И Renault_АвтоработыДопРеквизиты.ABS = &ABS
		|	И Renault_АвтоработыДопРеквизиты.СалонныйФильтр = &СалонныйФильтр
		|	И (Renault_АвтоработыДопРеквизиты.ТипДвигателя = &ТипДвигателя
		|			ИЛИ &ТипДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.ТипТоплива = &ТипТоплива
		|			ИЛИ &ТипТоплива = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексДвигателя = &ИндексДвигателя
		|			ИЛИ &ИндексДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.КодКПП = &КодКПП
		|			ИЛИ &КодКПП = """")
		|	И Renault_АвтоработыДопРеквизиты.Авторабота.Наименование = ""К_расширенный""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Renault_АвтоработыДопРеквизиты.Авторабота,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.Renault_АвтоработыДопРеквизиты КАК Renault_АвтоработыДопРеквизиты
		|ГДЕ
		|	(Renault_АвтоработыДопРеквизиты.КодМодели = &КодМодели
		|			ИЛИ &КодМодели = """")
		|	И (Renault_АвтоработыДопРеквизиты.Фаза = &Фаза
		|			ИЛИ Renault_АвтоработыДопРеквизиты.Фаза = ЗНАЧЕНИЕ(Справочник.Renault_ФазыМоделей.ПустаяСсылка))
		|	И (Renault_АвтоработыДопРеквизиты.КодДвигателя = &КодДвигателя
		|			ИЛИ &КодДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.Привод = &Привод
		|			ИЛИ &Привод = ""4x2"")
		|	И Renault_АвтоработыДопРеквизиты.ABS = &ABS
		|	И (Renault_АвтоработыДопРеквизиты.ТипТоплива = &ТипТоплива
		|			ИЛИ &ТипТоплива = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексДвигателя = &ИндексДвигателя
		|			ИЛИ &ИндексДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.КодКПП = &КодКПП
		|			ИЛИ &КодКПП = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексКПП = &ИндексКПП
		|			ИЛИ &ИндексКПП = """")
		|	И Renault_АвтоработыДопРеквизиты.Авторабота.Наименование = ""Колодки передние +диски""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Renault_АвтоработыДопРеквизиты.Авторабота,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.Renault_АвтоработыДопРеквизиты КАК Renault_АвтоработыДопРеквизиты
		|ГДЕ
		|	(Renault_АвтоработыДопРеквизиты.КодМодели = &КодМодели
		|			ИЛИ &КодМодели = """")
		|	И (Renault_АвтоработыДопРеквизиты.Фаза = &Фаза
		|			ИЛИ Renault_АвтоработыДопРеквизиты.Фаза = ЗНАЧЕНИЕ(Справочник.Renault_ФазыМоделей.ПустаяСсылка))
		|	И (Renault_АвтоработыДопРеквизиты.КодДвигателя = &КодДвигателя
		|			ИЛИ &КодДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.Привод = &Привод
		|			ИЛИ &Привод = ""4x2"")
		|	И Renault_АвтоработыДопРеквизиты.ABS = &ABS
		|	И (Renault_АвтоработыДопРеквизиты.ТипТоплива = &ТипТоплива
		|			ИЛИ &ТипТоплива = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексДвигателя = &ИндексДвигателя
		|			ИЛИ &ИндексДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.КодКПП = &КодКПП
		|			ИЛИ &КодКПП = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексКПП = &ИндексКПП
		|			ИЛИ &ИндексКПП = """")
		|	И Renault_АвтоработыДопРеквизиты.Авторабота.Наименование = ""Колодки задние""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Renault_АвтоработыДопРеквизиты.Авторабота,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.Renault_АвтоработыДопРеквизиты КАК Renault_АвтоработыДопРеквизиты
		|ГДЕ
		|	(Renault_АвтоработыДопРеквизиты.КодМодели = &КодМодели
		|			ИЛИ &КодМодели = """")
		|	И (Renault_АвтоработыДопРеквизиты.Фаза = &Фаза
		|			ИЛИ Renault_АвтоработыДопРеквизиты.Фаза = ЗНАЧЕНИЕ(Справочник.Renault_ФазыМоделей.ПустаяСсылка))
		|	И (Renault_АвтоработыДопРеквизиты.КодДвигателя = &КодДвигателя
		|			ИЛИ &КодДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.ТипТоплива = &ТипТоплива
		|			ИЛИ &ТипТоплива = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексДвигателя = &ИндексДвигателя
		|			ИЛИ &ИндексДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.КодКПП = &КодКПП
		|			ИЛИ &КодКПП = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексКПП = &ИндексКПП
		|			ИЛИ &ИндексКПП = """")
		|	И Renault_АвтоработыДопРеквизиты.Авторабота.Наименование = ""Очистка системы конд-я""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Renault_АвтоработыДопРеквизиты.Авторабота,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.Renault_АвтоработыДопРеквизиты КАК Renault_АвтоработыДопРеквизиты
		|ГДЕ
		|	(Renault_АвтоработыДопРеквизиты.КодМодели = &КодМодели
		|			ИЛИ &КодМодели = """")
		|	И (Renault_АвтоработыДопРеквизиты.Фаза = &Фаза
		|			ИЛИ Renault_АвтоработыДопРеквизиты.Фаза = ЗНАЧЕНИЕ(Справочник.Renault_ФазыМоделей.ПустаяСсылка))
		|	И (Renault_АвтоработыДопРеквизиты.КодДвигателя = &КодДвигателя
		|			ИЛИ &КодДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.ТипДвигателя = &ТипДвигателя
		|			ИЛИ &ТипДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.ТипТоплива = &ТипТоплива
		|			ИЛИ &ТипТоплива = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексДвигателя = &ИндексДвигателя
		|			ИЛИ &ИндексДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.КодКПП = &КодКПП
		|			ИЛИ &КодКПП = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексКПП = &ИндексКПП
		|			ИЛИ &ИндексКПП = """")
		|	И Renault_АвтоработыДопРеквизиты.Авторабота.Наименование = ""Замена салонного фильтра""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Renault_АвтоработыДопРеквизиты.Авторабота,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.Renault_АвтоработыДопРеквизиты КАК Renault_АвтоработыДопРеквизиты
		|ГДЕ
		|	(Renault_АвтоработыДопРеквизиты.КодМодели = &КодМодели
		|			ИЛИ &КодМодели = """")
		|	И (Renault_АвтоработыДопРеквизиты.Фаза = &Фаза
		|			ИЛИ Renault_АвтоработыДопРеквизиты.Фаза = ЗНАЧЕНИЕ(Справочник.Renault_ФазыМоделей.ПустаяСсылка))
		|	И (Renault_АвтоработыДопРеквизиты.КодДвигателя = &КодДвигателя
		|			ИЛИ &КодДвигателя = """")
		|	И Renault_АвтоработыДопРеквизиты.Кондиционер = &Кондиционер
		|	И (Renault_АвтоработыДопРеквизиты.ТипТоплива = &ТипТоплива
		|			ИЛИ &ТипТоплива = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексДвигателя = &ИндексДвигателя
		|			ИЛИ &ИндексДвигателя = """")
		|	И (Renault_АвтоработыДопРеквизиты.КодКПП = &КодКПП
		|			ИЛИ &КодКПП = """")
		|	И (Renault_АвтоработыДопРеквизиты.ИндексКПП = &ИндексКПП
		|			ИЛИ &ИндексКПП = """")
		|	И Renault_АвтоработыДопРеквизиты.Авторабота.Наименование = ""Пакет с салонным фильтром""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_АвтоработыЦеныСрезПоследних.ИтогоНЧ КАК ИтогоНЧ,
		|	ВЫБОР
		|		КОГДА &ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.Renault_ТарифныеЗоны.ТЗ1)
		|			ТОГДА Renault_АвтоработыЦеныСрезПоследних.СтоимостьНормоЧасаСНДС1
		|		ИНАЧЕ Renault_АвтоработыЦеныСрезПоследних.СтоимостьНормоЧасаСНДС2
		|	КОНЕЦ КАК СтоимостьНормоЧасаСНДС,
		|	ВЫБОР
		|		КОГДА &ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.Renault_ТарифныеЗоны.ТЗ1)
		|			ТОГДА Renault_АвтоработыЦеныСрезПоследних.Цена1ТЗ
		|		ИНАЧЕ Renault_АвтоработыЦеныСрезПоследних.Цена2ТЗ
		|	КОНЕЦ КАК ЦенаТЗ,
		|	Renault_АвтоработыЦеныЗапчастейСрезПоследних.Запчасть КАК СвязанныеАвтоработы,
		|	Renault_АвтоработыЦеныЗапчастейСрезПоследних.Количество,
		|	Renault_АвтоработыЦеныЗапчастейСрезПоследних.PNC,
		|	Renault_АвтоработыЦеныЗапчастейСрезПоследних.PCL,
		|	ВсеАвтоработы.Авторабота КАК Авторабота,
		|	ВсеАвтоработы.Выбрать
		|ИЗ
		|	ВсеАвтоработы КАК ВсеАвтоработы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтоработыЦены.СрезПоследних КАК Renault_АвтоработыЦеныСрезПоследних
		|		ПО ВсеАвтоработы.Авторабота = Renault_АвтоработыЦеныСрезПоследних.Авторабота
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтоработыЦеныЗапчастей.СрезПоследних КАК Renault_АвтоработыЦеныЗапчастейСрезПоследних
		|		ПО ВсеАвтоработы.Авторабота = Renault_АвтоработыЦеныЗапчастейСрезПоследних.Авторабота
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВсеАвтоработы.Авторабота.Наименование
		|ИТОГИ
		|	МАКСИМУМ(ИтогоНЧ),
		|	МАКСИМУМ(СтоимостьНормоЧасаСНДС),
		|	МАКСИМУМ(ЦенаТЗ)
		|ПО
		|	Авторабота"; 
	
	Запрос.УстановитьПараметр("ABS", ABS);
	Запрос.УстановитьПараметр("ГУР", ГУР);
	Запрос.УстановитьПараметр("КодДвигателя", КодТипаДвигателя);
	Запрос.УстановитьПараметр("КодМодели", КодМоделиКузова);
	Запрос.УстановитьПараметр("Кондиционер", Кондиционер);
	Запрос.УстановитьПараметр("Привод", Привод);
	Запрос.УстановитьПараметр("СалонныйФильтр", СалонныйФильтр);
	Запрос.УстановитьПараметр("Фаза", Фаза);
	Запрос.УстановитьПараметр("ТарифнаяЗона", ТарифнаяЗона);
	Запрос.УстановитьПараметр("ТипТоплива", ТипТоплива);
	Запрос.УстановитьПараметр("ТипДвигателя", ТипДвигателя);
	Запрос.УстановитьПараметр("ИндексДвигателя", ИндексДвигателя);
	Запрос.УстановитьПараметр("ИндексКПП", ИндексКПП);
	Запрос.УстановитьПараметр("КодКПП", КодКПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДЗ = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЗначениеВРеквизитФормы(ДЗ, "ДеревоКомплексовАвторабот");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоАвторабот(Команда)
	
	ЗаполнитьДеревоАвтоработНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКомплексовАвтоработВнестиПриИзменении(Элемент)
	
	ТекущаяСтрокаДерева = ДеревоКомплексовАвторабот.НайтиПоИдентификатору(Элементы.ДеревоКомплексовАвторабот.ТекущаяСтрока);
	ПодчиненнныеСтроки = ТекущаяСтрокаДерева.ПолучитьЭлементы();
	Для каждого стр Из ПодчиненнныеСтроки Цикл
		стр.Выбрать = ТекущаяСтрокаДерева.Выбрать;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыбранныеВДокумент(Команда)
	
	Ответ = Новый Структура("ДеревоКомплексовАвторабот");
	ПеренестиВыбранныеВДокументнаСервере(Ответ);
	Оповестить("ВыборКомплексАвторабот", Ответ);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиВыбранныеВДокументнаСервере(Ответ)
	
	Запись = РегистрыСведений.Renault_АвтомобилиДопРеквизиты.СоздатьМенеджерЗаписи();
	Запись.Автомобиль = Автомобиль;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Записывать = Ложь;
		Если Не ЗначениеЗаполнено(Запись.ТипДвигателя) Тогда
			Запись.ТипДвигателя = ТипДвигателя;
			Записывать = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ТипТоплива) Тогда
			Запись.ТипТоплива = ТипТоплива;
			Записывать = Истина;
		КонецЕсли;
		
		Если Записывать Тогда
			Запись.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Ответ.ДеревоКомплексовАвторабот = РеквизитФормыВЗначение("ДеревоКомплексовАвторабот");
	
КонецПроцедуры // ПеренестиВыбранныеВДокументнаСервере()
